
/*
2. Меньшее по модулю число
Создать программу, которая будет выводить на экран меньшее по модулю из трёх введённых пользователем вещественных чисел.
Для вычисления модуля используйте тернарную условную операцию.
Для ввода чисел используем класс Scanner.
Решение на Patreon.


package examclouds.com.operations;

import java.util.Scanner;

public class _2 {

    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.println("Нахождения меньшего по модулю числа");
        System.out.print("введите число: ");
        double digit1 = scanner.nextDouble();
        double digit2 = scanner.nextDouble();
        double digit3 = scanner.nextDouble();
        (digit1>digit2)?

    }

}
 */